import random

grades = ['ثالث أ', 'ثالث ب', 'رابع أ', 'رابع ب', 'خامس أ', 'خامس ب', 'سادس أ', 'سادس ب']

subjects = ['رياضيات', 'علوم', 'إنجليزي', 'اجتماعيات', 'دين', 'مهارات تقنية', 'بدنية', 'لغتي']

teachers = ['معلم1', 'معلم2']

# Updated qualified dictionary with more teachers for Grade 7 and Grade 8
qualified = {
    'معلم1': [('ثالث أ', 'رياضيات'), ('ثالث ب', 'رياضيات'), ('رابع أ', 'رياضيات'), ('رابع ب', 'رياضيات')],
    'معلم2': [('خامس أ', 'رياضيات'), ('خامس ب', 'رياضيات'), ('سادس أ', 'رياضيات'), ('سادس ب', 'رياضيات')],
}

days = ['الأحد', 'الإثنين', 'الثلاثاء', 'الأربعاء', 'الخميس']
slots_per_day = 8



